hazy1k/STM32-Study-Notes/6.野火官方资料/电机应用开发实战/野火步进电机驱动器_测试例程/F767挑战者_V2开发板/EBF-SMD4805测试程序/User/usart/bsp_usart.h
#ifndef __USARTx_H
#define	__USARTx_H

#include "stm32f7xx.h"
#include <stdio.h>

//串口接收缓冲数组大小
#define UART_RX_BUFFER_SIZE 256 
extern UART_HandleTypeDef UartHandle;
extern unsigned char UART_RxBuffer[UART_RX_BUFFER_SIZE];
//引脚定义
/*******************************************************/
#define UARTx                             USART1
#define UARTx_CLK_ENABLE()                __USART1_CLK_ENABLE();

#define RCC_PERIPHCLK_UARTx               RCC_PERIPHCLK_USART1
#define RCC_UARTxCLKSOURCE_SYSCLK         RCC_USART1CLKSOURCE_SYSCLK

#define UARTx_RX_GPIO_PORT                GPIOA
#define UARTx_RX_GPIO_CLK_ENABLE()        __GPIOA_CLK_ENABLE()
#define UARTx_RX_PIN                      GPIO_PIN_10
#define UARTx_RX_AF                       GPIO_AF7_USART1


#define UARTx_TX_GPIO_PORT                GPIOA
#define UARTx_TX_GPIO_CLK_ENABLE()        __GPIOA_CLK_ENABLE()
#define UARTx_TX_PIN                      GPIO_PIN_9
#define UARTx_TX_AF                       GPIO_AF7_USART1

#define DEBUG_USART_IRQHandler                  USART1_IRQHandler
#define DEBUG_USART_IRQ                 		  USART1_IRQn
/************************************************************/


//串口波特率
#define UARTx_BAUDRATE                    115200
void uart_FlushRxBuffer(void);
void UARTx_Config(void);
//int fputc(int ch, FILE *f);
extern UART_HandleTypeDef UartHandle;
#endif /* __USART1_H */
